#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_pet.aks: Refreshing state... [id=aks-beloved-wren]
random_string.tf-storage-name: Refreshing state... [id=tmccfvikzuankdqxpfg10ko]
azurerm_resource_group.rg-networking: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking]
azurerm_resource_group.rg-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks]
azurerm_resource_group.rg-tf-state: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state]
azurerm_storage_account.tf-storage: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state/providers/Microsoft.Storage/storageAccounts/tmccfvikzuankdqxpfg10ko]
azurerm_network_security_group.nsg-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/networkSecurityGroups/nsg-bastion]
azurerm_virtual_network.vnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default]
azurerm_network_security_group.nsg-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/networkSecurityGroups/nsg-default]
azurerm_public_ip.vip-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/publicIPAddresses/vip-bastion]
azurerm_subnet.subnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/DefaultSubnet]
azurerm_subnet.subnet-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AzureBastionSubnet]
azurerm_subnet.subnet-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AKSSubnet]
azurerm_kubernetes_cluster.aks-lab: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren]
azurerm_bastion_host.bastion-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/bastionHosts/bastion-default]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_bastion_host.bastion-default has changed
  ~ resource "azurerm_bastion_host" "bastion-default" {
        id                     = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/bastionHosts/bastion-default"
        name                   = "bastion-default"
      + tags                   = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_kubernetes_cluster.aks-lab has changed
  ~ resource "azurerm_kubernetes_cluster" "aks-lab" {
      + api_server_authorized_ip_ranges     = []
        id                                  = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren"
        name                                = "aks-beloved-wren"
        tags                                = {
            "deployedBy"  = "terraform"
            "environment" = "lab"
            "msftalias"   = "sladeedmonds"
        }
        # (22 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "pool0"
          + node_taints                  = []
          + tags                         = {}
          + zones                        = []
            # (19 unchanged attributes hidden)
        }




        # (4 unchanged blocks hidden)
    }

  # azurerm_resource_group.rg-aks has changed
  ~ resource "azurerm_resource_group" "rg-aks" {
        id       = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks"
        name     = "rg-aks"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.kv-sandbox will be created
  + resource "azurerm_key_vault" "kv-sandbox" {
      + access_policy              = (known after apply)
      + id                         = (known after apply)
      + location                   = "eastus"
      + name                       = (known after apply)
      + resource_group_name        = "rg-sandbox-keyvault"
      + sku_name                   = "standard"
      + soft_delete_retention_days = 90
      + tenant_id                  = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.rg-keyvault will be created
  + resource "azurerm_resource_group" "rg-keyvault" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-sandbox-keyvault"
    }

  # random_pet.kv will be created
  + resource "random_pet" "kv" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "kv"
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @sladeedmonds, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*